In [1]:
import numpy as np
import pandas as pd

In [2]:
pd.__version__

'1.0.3'

In [3]:
np.__version__

'1.18.1'

# 1.对象

1. Series

2. DataFrame

3. Index

## 1.1Series

In [4]:
data = pd.Series([2,4,5,1,6,3])
data

0    2
1    4
2    5
3    1
4    6
5    3
dtype: int64

In [5]:
data.keys()

RangeIndex(start=0, stop=6, step=1)

In [6]:
data.values

array([2, 4, 5, 1, 6, 3], dtype=int64)

In [7]:
data.index

RangeIndex(start=0, stop=6, step=1)

Series与Numpy数组的区别：基本仅index的区别

In [8]:
data = pd.Series([1,4,0.3,5.7,5], index=list('igjeg'))
data

i    1.0
g    4.0
j    0.3
e    5.7
g    5.0
dtype: float64

In [9]:
data.index

Index(['i', 'g', 'j', 'e', 'g'], dtype='object')

In [10]:
data['g']

g    4.0
g    5.0
dtype: float64

Series基本就是字典类型，所以也可以根据字典数据来进行生成

In [11]:
alpha_beta = {
    'alpha': 1,
    'beta': 2,
    'gamma': 3,
    'phi': 4,
    'episilon': 5
}
data = pd.Series(alpha_beta)
data

alpha       1
beta        2
gamma       3
phi         4
episilon    5
dtype: int64

## 1.2DataFrame

表结构，相较于Series，多了一行columns结构

In [100]:
data = [{'a': i, 'b': i**2} for i in range(10)]
data = pd.DataFrame(data)
data

   a   b
0  0   0
1  1   1
2  2   4
3  3   9
4  4  16
5  5  25
6  6  36
7  7  49
8  8  64
9  9  81

In [13]:
data.stack(), data.stack()[7]

(0  a     0
    b     0
 1  a     1
    b     1
 2  a     2
    b     4
 3  a     3
    b     9
 4  a     4
    b    16
 5  a     5
    b    25
 6  a     6
    b    36
 7  a     7
    b    49
 8  a     8
    b    64
 9  a     9
    b    81
 dtype: int64,
 a     7
 b    49
 dtype: int64)

In [14]:
data.values.shape

(10, 2)

In [15]:
data.values[4]

array([ 4, 16], dtype=int64)

In [16]:
data.loc[3, 'b']

9

In [17]:
data.iloc[3:6, ::-1]

    b  a
3   9  3
4  16  4
5  25  5

使用**索引**取值时，取**列**值，当使用**切片**时，取**行**值

In [18]:
data[1:5]

   a   b
1  1   1
2  2   4
3  3   9
4  4  16

In [19]:
data['a']

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
Name: a, dtype: int64

可以通过Numpy结构数组来创建DataFrame数据

In [20]:
A = np.zeros(3, dtype=[('A', 'i8'), ('B', 'f8')])
A

array([(0, 0.), (0, 0.), (0, 0.)], dtype=[('A', '<i8'), ('B', '<f8')])

In [21]:
pd.DataFrame(A)

   A    B
0  0  0.0
1  0  0.0
2  0  0.0

## 1.3Index

可看成是不可变数组和有序集合

In [22]:
ind = pd.Index([2,3,5,7,11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

In [23]:
ind1 = pd.Index([1,6,7,3])
ind2 = pd.Index([3,6,8,4])

In [24]:
ind1 & ind2

Int64Index([6, 3], dtype='int64')

In [25]:
ind1 | ind2

Int64Index([1, 3, 4, 6, 7, 8], dtype='int64')

In [26]:
ind1 ^ ind2

Int64Index([1, 4, 7, 8], dtype='int64')

# 2.缺失值处理

1. isnull, notnull  判断是否为空

2. dropna, fillna  进行剔除或是填充

In [27]:
data1 = pd.Series([1,1,1,1])
data2 = pd.Series([2,2,2,2,2])

In [32]:
data = data1 + data2
data

0    3.0
1    3.0
2    3.0
3    3.0
4    NaN
dtype: float64

In [33]:
data.isnull()

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [34]:
data.notnull()

0     True
1     True
2     True
3     True
4    False
dtype: bool

In [36]:
data.dropna()

0    3.0
1    3.0
2    3.0
3    3.0
dtype: float64

In [39]:
data.fillna(0)

0    3.0
1    3.0
2    3.0
3    3.0
4    0.0
dtype: float64

In [43]:
d = pd.Series([np.nan, 1,np.nan, 3, 5,np.nan])
d

0    NaN
1    1.0
2    NaN
3    3.0
4    5.0
5    NaN
dtype: float64

In [46]:
d.fillna(method='bfill') #backwardfill

0    1.0
1    1.0
2    3.0
3    3.0
4    5.0
5    NaN
dtype: float64

In [47]:
d.fillna(method='ffill') #forwardfill

0    NaN
1    1.0
2    1.0
3    3.0
4    5.0
5    5.0
dtype: float64

# 3.多级索引

处理索引为**元组（多项）**的情况

In [90]:
df = pd.DataFrame(np.random.rand(4,2), index=[['a', 'a', 'b', 'b'], [1,2,1,2]], columns=['data1', 'data2'])
df

        data1     data2
a 1  0.534939  0.316794
  2  0.105353  0.577600
b 1  0.124912  0.554092
  2  0.736938  0.709032

有四种MultiIndex创建方式：

1. from_arrays   通过数组构建

2. from_tuples   通过元组构建

3. from_product  利用序列数据的笛卡尔积进行构建

4. from_frame  用DataFrame数据构建

In [91]:
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1,2,1,2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [92]:
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [95]:
pd.MultiIndex.from_product([['a', 'b'], [1,2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [102]:
pd.MultiIndex.from_frame(pd.DataFrame({'1':['a', 'a', 'b', 'b'], '2':[1,2,1,2]}))

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           names=['1', '2'])

In [106]:
data = pd.DataFrame({'a':list('asdf'), 'b':list('etxf')}, index=pd.MultiIndex.from_frame(pd.DataFrame({'1':['a', 'a', 'b', 'b'], '2':[1,2,1,2]})))
data

     a  b
1 2
a 1  a  e
  2  s  t
b 1  d  x
  2  f  f

In [109]:
data.index.names

FrozenList(['1', '2'])

DataFrame对象的columns和index都可以使用多级别索引

In [135]:
index = pd.MultiIndex.from_product([[2013, 2014], [3,4]], names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']], names=['subject', 'type'])
data = np.round(np.random.randn(4,6), 1)
data[:, ::2] *= 10
data += 37
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 3      38.0  37.5  37.0  36.8  28.0  36.6
     4      42.0  38.5  45.0  37.2  24.0  35.8
2014 3      41.0  38.7  24.0  37.2  33.0  37.7
     4      29.0  36.6  52.0  36.3  37.0  36.0

In [144]:
health_data.loc[2013, :]

subject   Bob       Guido         Sue
type       HR  Temp    HR  Temp    HR  Temp
visit
3        38.0  37.5  37.0  36.8  28.0  36.6
4        42.0  38.5  45.0  37.2  24.0  35.8

In [145]:
health_data.loc[(2013, 4), ('Guido', 'HR')]

45.0

In [149]:
health_data.sort_index()

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 3      38.0  37.5  37.0  36.8  28.0  36.6
     4      42.0  38.5  45.0  37.2  24.0  35.8
2014 3      41.0  38.7  24.0  37.2  33.0  37.7
     4      29.0  36.6  52.0  36.3  37.0  36.0

In [170]:
health_data.mean(level='year')

subject   Bob        Guido          Sue
type       HR   Temp    HR   Temp    HR   Temp
year
2013     40.0  38.00  41.0  37.00  26.0  36.20
2014     35.0  37.65  38.0  36.75  35.0  36.85

In [175]:
health_data.mean(level='subject', axis=1)

subject       Bob  Guido    Sue
year visit
2013 3      37.75  36.90  32.30
     4      40.25  41.10  29.90
2014 3      39.85  30.60  35.35
     4      32.80  44.15  36.50

# 4.数据连接

1. pd.concat

2. append

3. merge

## 4.1 常用连接Concat和Append

## 4.2 高性能合并(Merge)和连接(Join)

基于关系代数理论进行操作

### 4.2.1 Merge

Merge接口实现了**一对一**，**多对一**， **多对多**

In [177]:
# 一对一
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                   'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                   'hire_data': [2004, 2008, 2012, 2014]})
print(df1);print(df2)

df3 = pd.merge(df1, df2)
df3

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_data
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

  employee        group  hire_data
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [179]:
# 多对一连接
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                   'supervisor': ['Carly', 'Guido', 'Steve']})
print(df3); print(df4)
pd.merge(df3, df4)

  employee        group  hire_data
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

  employee        group  hire_data supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

In [180]:
# 多对多连接
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting', 'Engineering', 'Engineering', 'HR', 'HR'],
                   'skills': ['math', 'spreadsheets', 'coding', 'linux', 'spreadsheets', 'organization']})
print(df1); print(df5)
pd.merge(df1, df5)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

设置要合并的键

1. on参数，指定按哪一列进行合并（只有在有共同列时才能使用）

2. left_on, right_on，用于合并列名不同，但是该列的数据项都取值是相同的

3. left_index, right_index，根据索引进行合并

In [181]:
print(df1); print(df2)
pd.merge(df1, df2, on='employee')

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_data
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

  employee        group  hire_data
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [184]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                   'salary': [70000, 80000, 120000, 90000]})
print(df1); print(df3)
pd.merge(df1, df3, left_on='employee', right_on='name')

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

通过上一种合并方式，尽管employee和name中数据对应，但是合并结果中保留了冗余项，可通过drop进行剔除

In [185]:
pd.merge(df1, df3, left_on='employee', right_on='name').drop('name', axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [192]:
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
print(df1a); print(df2a)
pd.merge(df1a, df2a, left_index=True, right_index=True)

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
          hire_data
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

                group  hire_data
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

可混用上述两种：left_index(right_index), left_on(right_on)

In [196]:
print(df1a); print(df3)

pd.merge(df1a, df3, left_index=True, right_on='name')

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
2  Engineering  Lisa  120000
3           HR   Sue   90000

对于合并列中数据集不完全对应时，即某些值出现在其中一列，但未出现在另外一列，merge默认情况下是采用内连接

1. inner内连接，合并结果只包含两者的交集

2. outer外连接，合并结果包含两者并集，缺失值用NaN进行填充

3. left左连接，结果只包含左列，

4. right右连接，结果只包含右列

In [197]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                   'food': ['fish', 'beans', 'bread']})
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                   'drink': ['wine', 'beer']})
print(df6); print(df7)
pd.merge(df6, df7)

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
     name drink
0    Mary  wine
1  Joseph  beer

   name   food drink
0  Mary  bread  wine

In [199]:
pd.merge(df6, df7, how='inner')

   name   food drink
0  Mary  bread  wine

In [200]:
pd.merge(df6, df7, how='outer')

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [201]:
pd.merge(df6, df7, how='left')

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [202]:
pd.merge(df6, df7, how='right')

     name   food drink
0    Mary  bread  wine
1  Joseph    NaN  beer

对于有重名列，即除了指定的合并列外，还有其它列重名，默认情况下(指定合并列)会增加后缀以区分

可通过参数suffixes，进行自定义后缀

**注**：suffixes适用于各类连接方式

In [205]:
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                   'rank': [1, 2, 3, 4]})
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                   'rank': [3, 1, 4, 2]})
print(df8); print(df9)
pd.merge(df8, df9, on='name')

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [206]:
pd.merge(df8, df9, on='name', suffixes=['_L', '_R'])

   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

### 4.2.2 Join

join可默认直接按索引进行合并

In [193]:
print(df1a); print(df2a)
df1a.join(df2a)

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
          hire_data
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

                group  hire_data
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

# 5.GroupBy